first_routes/app/controllers/users_controller.rb

  def show
    user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    user = User.new(params.require(:user).permit(:email, :name))
    # replace the `user_attributes_here` with the actual attribute keys
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "peter"], ["email", "peter@peter.com"], ["created_at", "2018-07-09 23:28:29.299816"], ["updated_at", "2018-07-09 23:28:29.299816"]]

  def update
    # params.require(:user).permit(:email, :name)

    user = User.find_by(id: params[:id])

    if user.update(name: params[:user][:name], email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Pan"], ["email", "email"], ["updated_at", "2018-07-10 00:10:45.091555"], ["id", 4]]

  def destroy
    user = User.find_by(id: params[:id])

    if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]